In [1]:
import pandas as pd
import sqlalchemy as sql

In [2]:
database_connection_string = 'sqlite:///'

In [3]:
engine = sql.create_engine(
    database_connection_string
)

engine

Engine(sqlite:///)

In [4]:
engine.table_names()

C:\Users\admin\AppData\Local\Temp\ipykernel_14900\4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

[]

In [5]:
stocks_dataframe = pd.DataFrame(
    {
        'AAPL': [
            1,
            2
        ]
        ,
        'GOOG': [
            3,
            4
        ]
    }
)

stocks_dataframe

   AAPL  GOOG
0     1     3
1     2     4

In [6]:
stocks_dataframe.to_sql(
    'stocks',
    engine
)

2

In [7]:
engine.table_names()

C:\Users\admin\AppData\Local\Temp\ipykernel_14900\4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['stocks']

In [8]:
sql_stocks_df = pd.read_sql_table(
    'stocks',
    con= engine
)

sql_stocks_df

   index  AAPL  GOOG
0      0     1     3
1      1     2     4

In [14]:
stocks_dataframe.to_sql(
    'stocks',
    engine,
    index= False,
    if_exists= 'replace'
)

2

In [16]:
sql_stocks_df = pd.read_sql_table(
    'stocks',
    con= engine
)

sql_stocks_df

   AAPL  GOOG
0     1     3
1     2     4

In [18]:
database_connection_string = 'sqlite:///'

engine = sql.create_engine(
    database_connection_string
)

engine

Engine(sqlite:///)

In [19]:
stocks_df = pd.DataFrame(
    {
        'GS': [
            9,
            10
        ]
        ,
        'PYPL': [
            11,
            12
        ]
    }
)

stocks_df

   GS  PYPL
0   9    11
1  10    12

In [20]:
stocks_df.to_sql(
    'stocks',
    engine,
    index= False,
    if_exists= 'replace'
)

2

In [23]:
sql_stocks_df = pd.read_sql_table(
    'stocks',
    con= engine
)

sql_stocks_df

   GS  PYPL
0   9    11
1  10    12

___

# Skill Drill

In [9]:
database_connection_string = 'sqlite:///'

engine = sql.create_engine(
    database_connection_string
)

engine

Engine(sqlite:///)

In [10]:
stocks_df = pd.DataFrame(
    {
        'MSFT': [
            5,
            6
        ]
        ,
        'TSLA': [
            7,
            8
        ]
    }
)

stocks_df

   MSFT  TSLA
0     5     7
1     6     8

In [11]:
stocks_df.to_sql(
    'stocks',
    engine
)

2

In [12]:
engine.table_names()

C:\Users\admin\AppData\Local\Temp\ipykernel_14900\4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['stocks']

In [13]:
sql_stocks_df = pd.read_sql_table(
    'stocks',
    con = engine
)

sql_stocks_df

   index  MSFT  TSLA
0      0     5     7
1      1     6     8

___